Revit 2027 API
PointCloudType.GetPath Method
 Gets the path of the link source from which the points are loaded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetPath()
Public Function GetPath As ModelPath
public:
ModelPath^ GetPath()
member GetPath : unit -> ModelPath
Return Value
ModelPath
 Returns the file path for a file based point cloud or null for the non-file based point cloud.
See Also
Reference
PointCloudType Class
Autodesk.Revit.DB Namespace